Repository: 84000/data-translation-memory
Catalog: toh182-v2.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཟས་དང་། སྐོམ་དང་། བཞོན་པ་དང་། གོས་དང་། རྒྱན་སྦྱིན་པ་ལ་མངོན་པར་བརྩོན་པར་བྱེད་པ་ནས་རྐང་སྦྱིན་པའི་བར་དག་ལ་མངོན་པར་བརྩོན་པར་བྱེད་དོ། །
en: Noble son, bodhisattva great beings exert themselves in the practice of generosity starting by offering food, beverages, vehicles, clothing, and ornaments, until they are able to offer the marrow of their own bones.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཟས་སྦྱིན་པ་དག་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “Noble son, how do bodhisattvas exert themselves in the practice of generosity by offering food?

source: ཟས་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་ཚེ་དང་། ཁ་དོག་དང་། སྟོབས་དང་། བདེ་བ་འགྲུབ་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་ནོ། །
en: ‘Offering food represents the achievement of longevity, luster, power, and happiness.

source: དེ་ལྟ་བས་ན་བདག་གིས་ཟས་སྦྱིན་པ་ལ་མངོན་པར་བརྩོན་པར་བྱ་དགོས་ཏེ།
en: I must therefore exert myself in offering food;

source: བདག་གིས་ཟས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering food!’

source: དེས་ཟས་ཀྱི་སྦྱིན་པ་དེ་བྱིན་པས་ཚེ་བྱིན་པ་དང་། བདེ་བ་བྱིན་པར་འགྱུར་རོ། །
en: The generosity practiced by offering food with such thoughts will provide longevity and happiness.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: At this point, the Blessed One uttered these verses:

source: ཁ་ཟས་སྦྱིན་པ་བྱིན་ན་ནི། །དེས་ན་ཚེ་དང་ཁ་དོག་དང་། །སྟོབས་དང་བདེ་བ་ལྔ་པ་སྤོབས། །ཤེས་རབ་ཅན་གྱིས་བྱིན་པ་ཡིན། །
en: “Through the generosity practiced by offering food, The wise ones extend a fivefold gift: Longevity, luster, power, Happiness, and eloquence.

source: ཁ་ཟས་བྱིན་པས་དགའ་བ་དང་། །ཚེ་རིང་སྟོབས་ལྡན་བདེ་སྐྱིད་འགྱུར། །
en: “Those who offer food will themselves experience Joy, longevity, strength, and well-being.

source: སྐྱིད་ཅིང་བརྟེན་པ་དེ་དག་ནི། །ཐོགས་མེད་སྤོབས་དང་ལྡན་པར་འགྱུར། །
en: Such happy persons, supported by such qualities, Will develop unhindered eloquence.

source: ཕྱུག་ཅིང་ནོར་མང་དཔལ་དང་ལྡན། །མི་ནི་དེས་ཤིང་བློ་ལྡན་ལ། །བསོད་ནམས་ལྡན་ཞིང་མཁས་ལ་ཞི། །
en: “They will become wealthy, affluent, Illustrious, noble-minded, intelligent, Meritorious, learned, and calm.

source: ཁ་ཟས་བྱིན་པས་དེ་ལྟར་འགྱུར། །
en: Such are the consequences of offering food.

source: དེ་ལ་སྐོམ་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering beverages?

source: སྐོམ་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་ཉོན་མོངས་པའི་སྲེད་པ་ཐམས་ཅད་སེལ་བར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་ཏེ།
en: ‘Offering beverages represents the elimination of all thirst associated with the afflictions.

source: དེ་ལྟ་བས་ན་བདག་གིས་སྐོམ་གྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering beverages!’

source: དེ་སྐོམ་གྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering beverages,

source: སངས་རྒྱས་ཀྱིས་བསྔགས་པའི་སྨོན་ལམ་བཞིན་དུ་སྐོམ་གྱི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations praised by the buddhas, through this offering of beverages

source: བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྲེད་པའི་རྒྱ་མཚོ་ཐམས་ཅད་སྐེམས་པར་བྱེད་པར་གྱུར་ཅིག །
en: may I dry up the entire ocean of thirst associated with the afflictions of all beings,

source: རྣམ་པར་གྲོལ་བའི་རོའི་སྐོམ་གྱིས་ཀྱང་ཚིམ་པར་བྱེད་པར་གྱུར་ཅིག་
en: and may the beverage with the taste of liberation satisfy them!’

source: ཅེས་སྨོན་ལམ་འདེབས་སོ། །
en: bodhisattvas make the following aspiration:

source: འདི་ལ་ཚིག་ཕྱི་མ་ཡང་ཡོད་དེ།
en: Regarding this, there are also some concluding verses:

source: རྒ་ཤིའི་ཆུ་སྲིན་གྱིས་དཀྲུགས་པའི། །ཉོན་མོངས་སྲེད་པའི་མཚོ་སྐེམས་ནས། །
en: “Having dried up the ocean of afflicted thirst, Where the sea monsters of old age and death roam,

source: རྣམ་གྲོལ་རོ་ཡི་སྐོམ་གྱིས་ནི། །མི་རྣམས་བདག་གིས་ཚིམ་པར་བྱ། །
en: I will satisfy human beings By providing the beverage with the taste of liberation.

source: སྐོམ་བྱིན་པས་ནི་མཁས་པ་དེ། །ཀུན་ཏུ་འབར་ཞིང་རབ་འབར་བའི། །ཡི་དགས་ཉམ་ངར་མི་སྐྱེ་ཞིང་། །སྐོམ་པའི་གནོད་པ་འབྱུང་མི་འགྱུར། །
en: “The wise ones who offer beverages Will never be reborn in the dreadful realms of starving spirits Where beings are consumed by the blazing fire of craving, And they will never again be tormented by thirst.

source: དེ་ལ་བཞོན་པའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering vehicles?

source: བཞོན་པའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བདེ་བ་དང་། རྫུ་འཕྲུལ་གྱི་གཞི་ཐམས་ཅད་སྤུད་པའི་ཚིག་བླ་དགས་ཡིན་གྱིས། བདག་གིས་བཞོན་པའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་སྟེ།
en: ‘Offering vehicles represents the gathering of all joy and the bases of miraculous power. I must therefore practice generosity by offering vehicles;

source: བཞོན་པ་ཤིང་རྟའམ། བཞོན་པ་ཁྱོགས་སམ། བཞོན་པ་རྟའམ། བཞོན་པ་གླང་པོ་ཆེའམ། ལྷ་མ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely offer chariots, palanquins, horses, elephants, and shoes!’

source: དེ་བཞོན་པའི་སྦྱིན་པ་དེ་དག་སྦྱིན་པ་ན།
en: Then, when practicing generosity by offering vehicles,

source: སངས་རྒྱས་ཀྱིས་བསྔགས་པའི་སྨོན་ལམ་བཞིན་དུ་བཞོན་པའི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་དང་། རྫུ་འཕྲུལ་གྱི་གཞི་ཐམས་ཅད་སྡུད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations praised by the buddhas, through this offering of vehicles may I gather every form of happiness and the bases of miraculous power for all beings!’

source: བཞོན་པ་ཤིང་རྟ་བྱིན་པ་ཡིས། །རྟག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས། །ཐེག་པ་ཆེན་པོ་ཐོབ་གྱུར་ཅིང་། །རྫུ་འཕྲུལ་རྐང་པ་ཐོབ་པར་ཤོག །
en: “May the offering of vehicles and chariots Forever cause all beings To attain the Great Vehicle And achieve the bases of miraculous power!

source: བཞོན་པ་སྦྱིན་པས་དྲང་སྲོང་ཆེ། །སངས་རྒྱས་ཞིང་ནས་ཞིང་དག་ཏུ། །བློ་ལྡན་བྱ་ཡི་ཤུགས་འདྲ་བར། །རྫུ་འཕྲུལ་གྱིས་ནི་མཁའ་ལ་འགྲོ། །
en: “The wise ones, the great sages who offer vehicles, Will miraculously travel through space From buddha realm to buddha realm, Like birds flying through the sky.

source: དེ་ལ་གོས་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering clothing?

source: གོས་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་དང་། མདོག་ཡོངས་སུ་དག་པར་བྱེད་པའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering clothing represents the perfection of one’s modesty, humility, and appearance. Therefore,

source: བདག་གིས་གོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering clothing!’

source: དེ་གོས་ཀྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering clothing,

source: སངས་རྒྱས་ཀྱིས་གནང་བའི་སྨོན་ལམ་བཞིན་དུ་གོས་ཀྱི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་དང་། མདོག་ཡོངས་སུ་དག་པར་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations made by the buddhas, through this offering of clothing may I perfect the modesty, humility, and appearance of all beings!’

source: གོས་ཀྱི་སྦྱིན་པ་འདིས་ན་བདག །སེམས་ཅན་ཀུན་གྱི་ངོ་ཚ་ཤེས། །ཁྲེལ་ཡོད་པ་ནི་སྦྱོང་བ་དང་། །མདོག་ཀྱང་དག་པར་བྱེད་གྱུར་ཅིག །
en: “Through this offering of clothing, May I perfect the modesty and humility Of all beings, And may I also purify their appearance!

source: གོས་སྦྱིན་ཤིན་ཏུ་དཔལ་དང་ལྡན། །རྟག་ཏུ་རིགས་ལྡན་གཟུགས་བཟང་ཞིང་། །མི་དེ་ངོ་ཚ་ཤེས་པར་འགྱུར། །
en: “Those illustrious beings who offer clothing Will always obtain a good caste and beautiful physique. Such persons will be modest

source: མི་ནི་གྲགས་ལྡན་སྐལ་དང་ལྡན། །
en: And find fame and fortune.

source: དེ་ལ་རྒྱན་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering ornaments?

source: རྒྱན་བྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering ornaments represents the perfection of the thirty-two major marks and the eighty minor marks of a great being.

source: བདག་གིས་རྒྱན་གྱི་སྦྱིན་པ་གསེར་གྱི་རྒྱན་ནམ། ནོར་བུའམ། མུ་ཏིག་གམ། བཻ་དཱུརྱའམ། དུང་ངམ། མན་ཤེལ་ལམ། བྱི་རུའི་རྒྱན་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering ornaments made of gold, jewels, pearls, beryls, conch shells, moonstones, and coral!’

source: དེ་རྒྱན་གྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering ornaments,

source: སངས་རྒྱས་ཀྱིས་གསུངས་པའི་སྨོན་ལམ་བཞིན་དུ། རྒྱན་གྱི་སྦྱིན་པ་འདིས་ན་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་དག་གིས་བརྒྱན་པ་མཐོང་བར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations expressed by the buddhas, through this offering of ornaments may I witness the bodies of all beings become adorned with the excellent major and minor marks!’

source: དེ་ལ་ཚིག་ཕྱི་མ་ཡང་ཡོད་དེ།
en: Regarding this, there are also some concluding verses:

source: གསེར་གྱི་རྒྱན་ནི་བྱིན་པ་ཡིས། །མཚན་རྣམས་ཀྱིས་ནི་བརྒྱན་པ་ཡི། །སེམས་ཅན་ཐམས་ཅད་མཐོང་གྱུར་ཅིང་། །བདག་ཀྱང་བྱང་ཆུབ་ཚོལ་བར་ཤོག །
en: “Through this offering of golden ornaments, May I see all beings Become adorned with the excellent marks, And may I also pursue awakening!

source: ནོར་བུ་མུ་ཏིག་བྱིན་པས་ནི། །གང་དང་གང་དུ་དེ་སྐྱེ་བ། །སྐྱེ་གནས་དེ་དང་དེ་དག་ཏུ། །རིན་ཆེན་ཆར་ནི་འབབ་པར་འགྱུར། །
en: “Those who offer jewels and pearls Will experience a rain of precious gems In all the places Where they are reborn.

source: དེ་ལ་མར་མེ་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering lamps?

source: མར་མེ་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་ལྷའི་མིག་ཡོངས་སུ་དག་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering lamps represents the purification of the divine eye. Therefore,

source: བདག་གིས་མར་མེའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering lamps!’

source: དེ་མར་མེའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན་
en: When practicing generosity by offering lamps,

source: སངས་རྒྱས་ཀྱིས་བསྟན་པའི་སྨོན་ལམ་བཞིན་དུ་མར་མེ་སྦྱིན་པ་འདིས་ན། བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྷའི་མིག་ཡོངས་སུ་དག་པར་འགྱུར་བའི་དོན་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations taught by the buddhas, through this offering of lamps may I cause the divine eye of all beings to be purified!’

source: ཀུན་མཁྱེན་ཡེ་ཤེས་འགྱུར་བ་ཡི། །མར་མེ་སྦྱིན་པ་དེས་ན་བདག །སེམས་ཅན་ཀུན་གྱི་ལྷ་ཡི་མིག །རྣམ་པར་དག་པར་བྱེད་གྱུར་ཅིག །
en: “Through this offering of the lamps Of omniscient wisdom, May I purify the divine eye Of all beings!

source: མི་དེ་མར་མེ་སྦྱིན་པ་ཡིས། །འཇིག་རྟེན་དག་ན་དུས་ཀུན་ཏུ། །སངས་རྒྱས་རྣམས་ཀྱི་སྤྱན་ལྔ་དང་། །རིམ་གྱིས་སུ་ནི་ལྡན་པར་འགྱུར། །
en: “Those who offer lamps Will always gradually achieve The five eyes of the buddhas Within the different worlds.

source: དེ་ལ་རོལ་མོའི་སྒྲ་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering music?

source: རོལ་མོའི་སྒྲའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་ལྷའི་རྣ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering music represents the perfection of the divine ear. Therefore,

source: བདག་གིས་རོལ་མོའི་སྒྲའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering music!’

source: དེ་རོལ་མོའི་སྒྲའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering music,

source: སངས་རྒྱས་རྣམ་པར་རོལ་པའི་སྨོན་ལམ་བཞིན་དུ། རོལ་མོའི་སྒྲའི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྷའི་རྣ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations taught by the buddhas, through this offering of music may I cause all beings to perfect the divine ear!’

source: རོལ་མོའི་སྒྲ་བྱིན་དེས་ན་བདག །སེམས་ཅན་ཀུན་ལ་ལྷ་རྣ་དང་། །སངས་རྒྱས་བྱང་ཆུབ་འགྲོ་ཕན་པ། །རབ་ཏུ་རྫོགས་པར་བྱེད་གྱུར་ཅིག །
en: “Through this offering of music, May I cause all beings To perfect the divine ear And progress to the awakening of the buddhas!

source: རོལ་མོ་སྒྲ་ནི་བྱིན་པས་ན། །རྫོགས་པའི་སངས་རྒྱས་གྲགས་ལྡན་པ། །དཔའ་བོ་རྣམས་ཀྱི་ལྷ་ཡི་སྙན། །གང་དུ་སྐྱེས་པ་དེ་ཡིས་འཐོབ། །
en: “Those who offer the sound of music, Wherever they are born, Will achieve the renown of the perfect buddhas And the divine ear of heroic beings.

source: དེ་ལ་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering perfumes, fragrant powders, and ointments?

source: སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering perfumes, fragrant powders, and ointments represents the perfumes, fragrant powders, and ointments of discipline, erudition, and absorption. Therefore,

source: བདག་གིས་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering perfumes, fragrant powders, and ointments!’

source: དེ་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering perfumes, fragrant powders, and ointments,

source: སངས་རྒྱས་ཀྱིས་དགོངས་པའི་སྨོན་ལམ་བཞིན་དུ་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པའི་སྦྱིན་པ་འདིས་ན་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྤོས་ཀྱིས་བྱུག་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations of the buddhas, through this offering of perfumes, fragrant powders, and ointments may I anoint all sentient beings with the fragrances of discipline, erudition, and absorption!’

source: སྤོས་དང་ཕྱེ་མ་བྱིན་པ་དང་། བྱུག་པ་དག་ནི་བྱིན་པ་ཡིས། །ཚུལ་ཁྲིམས་ཐོས་དང་ཏིང་ངེ་འཛིན། །ལུས་ཅན་རྣམས་ཀྱིས་ཐོབ་གྱུར་ཅིག །
en: “May this offering of perfumes, Fragrant powders, and ointments Cause all beings to achieve Discipline, erudition, and absorption!

source: སྤོས་དང་ཕྱེ་མ་བྱིན་པ་དང་། །བྱུག་པ་བྱིན་པས་སྐྱོབ་རྣམས་ཀྱི། །ལྷ་ཡི་ཤངས་དང་ལྷ་ཡི་སྐུ། །སྐྱོན་མེད་དེ་ཡིས་འཐོབ་པར་འགྱུར། །
en: “Those who offer perfumes, Fragrant powders, and ointments Will achieve the perfect divine nose of the protectors And the flawless body of the gods.

source: དེ་ལ་མེ་ཏོག་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering flowers?

source: མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་གི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་གཟུངས་དང་། སྤོབས་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རིན་པོ་ཆེའི་མེ་ཏོག་ཐོབ་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering flowers and flower garlands represents the attainment of the precious flowers of retention, eloquence, and the branches of awakening.

source: བདག་གིས་མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་གི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering flowers and flower garlands!’

source: དེ་མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་གི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering flowers and flower garlands,

source: སངས་རྒྱས་ཀྱིས་གསུངས་པའི་སྨོན་ལམ་བཞིན་དུ་མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་གི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations expressed by the buddhas, through this offering of flowers and flower garlands

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་གཟུངས་དང་། སྤོབས་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རིན་པོ་ཆེའི་མེ་ཏོག་གིས་བརྒྱན་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I adorn the body of all beings with the precious flowers of retention, eloquence, and the branches of awakening!’

source: མེ་ཏོག་མེ་ཏོག་ཕྲེང་བྱིན་པས། །མྱུར་བར་རྣམ་པ་ཐམས་ཅད་དུ། །བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་གིས། །ལུས་ཅན་ཀུན་ལ་བརྒྱན་པར་ཤོག །
en: “Through this offering of flowers and flower garlands, May all beings be adorned, Swiftly and in all manners, With the flowers of the branches of awakening!

source: མེ་ཏོག་མེ་ཏོག་ཕྲེང་བྱིན་པས། །གང་དང་གང་དུ་སྐྱེས་པ་དེར། །རྒྱལ་པོ་བློན་པོ་ཞང་བློན་གྱིས། །རྟག་ཏུ་མཆོད་ཅིང་རིམ་གྲོ་བྱེད། །
en: “Those who offer flowers and flower garlands, Wherever they are born, Will always be worshiped and venerated By kings, ministers, and officials.

source: དེ་ལ་རོ་བྲོ་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering delicacies?

source: རོ་བྲོ་བ་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་རོ་བྲོ་བའི་མཆོག་ཏུ་འགྱུར་བའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་དུ་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering delicacies represents the attainment of the mark of a great being who has the finest sense of taste. Therefore,

source: བདག་གིས་རོ་བྲོ་བའི་སྦྱིན་པ་རྒུན་གྱི་རོའམ། བུ་རམ་ཤིང་གི་རོའམ། སྦྲང་རྩིའི་རོའམ། མར་གྱི་རོའམ། འབྲུ་མར་གྱི་རོའམ། ལན་ཚྭའི་རོ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering the flavors of grape, molasses, honey, butter, oil, and salt!’

source: དེ་རོ་བྲོ་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering delicacies,

source: སངས་རྒྱས་ཀྱིས་བསྔགས་པའི་སྨོན་ལམ་བཞིན་དུ། རོའི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations praised by the buddhas, through this offering of delicacies

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་རོ་བྲོ་བའི་མཆོག་ཏུ་འགྱུར་བའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to perfect the mark of a great being who has the finest sense of taste!’

source: རོ་ཡི་སྦྱིན་པས་སེམས་ཅན་ཀུན། །ཀུན་མཁྱེན་རོ་ཡི་སྙིང་པོ་ཡིས། །རྫོགས་སངས་རྒྱས་པའི་བྱང་ཆུབ་ཀྱི། །སྤྱོད་པ་ཡོངས་སུ་རྫོགས་གྱུར་ཅིག །
en: “Through this offering of savory flavors, May all beings Experience the essential taste of omniscience, And so perfect the awakened conduct of the perfect buddhas!

source: རོ་ཡི་སྦྱིན་པས་ཡིད་གཞུངས་ཤིང་། །དྲན་ལྡན་བློ་གྲོས་རྒྱ་མཚོ་བཞིན། །དེས་ནི་རོ་ཡི་རྣམ་གྲངས་འཐོབ། །
en: “Those who offer delicacies develop mental sharpness, Excellent memory, and oceanic intelligence.

source: ལྷུན་གྱིས་གྲུབ་པར་ལོངས་སྤྱོད་ལྡན། །
en: They will enjoy a variety of tasty flavors And will effortlessly prosper.

source: དེ་ལ་གནས་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering residences?

source: གནས་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་དང་། སྐྱོབ་པ་དང་། གླིང་དང་། སྐྱབས་དང་། དཔུང་གཉེན་དུ་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering residences represents becoming a shelter, a protector, a support, a refuge, and a helper for all beings.

source: བདག་གིས་གནས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering residences!’

source: དེ་གནས་ཀྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering residences,

source: སངས་རྒྱས་ཀྱིས་དམིགས་པའི་སྨོན་ལམ་བཞིན་དུ་གནས་ཀྱི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་དང་། སྐྱོབ་པ་དང་། གླིང་དང་། སྐྱབས་དང་། དཔུང་གཉེན་དུ་གྱུར་ཅིག་
en: ‘In accordance with the aspirations observed by the buddhas, through this offering of residences may I become a shelter, a protector, a support, a refuge, and a helper for all beings!’

source: གཞལ་མེད་ཁང་གནས་སྦྱིན་པ་ཡིས། །བདག་ནི་འཛམ་བུའི་གླིང་དག་ཏུ། །ལུས་ཅན་རྣམས་ཀྱི་སྐྱོབ་དང་གླིང་། །སྐྱབས་དང་དཔུང་གཉེན་གྱུར་པར་ཤོག །
en: “Through the offering of palaces and residences, May I, within all the worlds, Become a protector, a support, a refuge, And a helper for all beings!

source: གཞལ་མེད་ཁང་གནས་སྦྱིན་པ་ཡིས། །གང་དང་གང་དུ་སྐྱེས་པ་ན། །
en: “Those who offer palaces and residences, Wherever they are born,

source: ཁྱིམ་དང་གནས་དང་ཡུལ་འཁོར་གྱི། །བདག་པོ་དང་ནི་གཙོ་བོར་འགྱུར། །
en: Will be the owners and leaders Of households, residences, and countries.

source: དེ་ལ་མལ་དང་སྔས་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering beds and pillows?

source: མལ་དང་སྔས་ཀྱི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་སྒྲིབ་པ་ཐམས་ཅད་གཏན་སྤོང་བའི་འཕགས་པ་དང་། ལྷའི་ཚངས་པའི་གནས་དེ་བཞིན་གཤེགས་པའི་གཟིམས་མལ་དང་། འཕངས་སྦྱིན་པའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering beds and pillows represents the loftiness of permanently abandoning all obscurations, the divine abodes of Brahmā that are the sleeping chambers of the thus-gone ones, and the gift of elevation.

source: བདག་གིས་མལ་དང་སྔས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering beds and pillows!’

source: དེ་མལ་དང་སྔས་ཀྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering beds and pillows,

source: སངས་རྒྱས་ཀྱིས་བསྟན་པའི་སྨོན་ལམ་བཞིན་དུ་མལ་དང་སྔས་ཀྱི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་གཏན་སྤོང་བའི་འཕགས་པ་དང་། ལྷའི་ཚངས་པའི་གནས་དེ་བཞིན་གཤེགས་པའི་གཟིམས་མལ་དང་། འཕངས་སྦྱིན་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations taught by the buddhas, through this offering of beds and pillows may I confer the loftiness of permanently abandoning all obscurations of all beings, the divine abodes of Brahmā that are the sleeping chambers of the thus-gone ones, and the gift of elevation!’

source: མལ་དང་སྔས་རྣམས་བྱིན་པས་བདག་ལ་ནི། །བསོད་ནམས་ཚོགས་ནི་ཅུང་ཟད་ཅི་ཡོད་པ། །དེས་ན་བདག་གིས་སྐྱེ་བོའི་སྒྲིབ་པ་དག །སྡིག་པའི་བློ་གྲོས་ངན་པ་འཇོམས་པར་ཤོག །
en: “Through whatever merit I have accumulated By offering beds and pillows, May I overcome the obscurations of all beings As well as their distorted, perverted intelligence.

source: ལུས་ཅན་རྣམས་ཀྱི་ལྟ་བ་ངན་པ་ཡི། །དྲ་བ་ཤེས་རབ་མཚོན་གྱིས་གཅོད་པར་ཤོག །
en: “May I sever the web of their negative views With the sword of insight,

source: བདེ་བར་གཤེགས་པ་རྣམས་ལ་འོས་པ་ཡི། །མལ་མཆོག་ཚངས་གནས་བསྟེན་པ་སྦྱིན་པར་ཤོག །
en: And offer them perfect beds worthy of the blissful ones And rested upon in the abodes of Brahmā.

source: མལ་དང་སྔས་རྣམས་སྦྱིན་པར་བྱེད་པའི་མི། །བསྟན་བཅོས་དག་ལ་མཁས་པར་སྐྱེ་བར་འགྱུར། །
en: “Those who offer beds and pillows Will be reborn as experts in the treatises.

source: ཞི་གནས་འཐོབ་ཅིང་རྒྱ་ཆེར་སྦྱིན་པ་དང་། །པད་མ་ལས་བྱུང་གཟི་ཅན་གཞོན་ནུར་འགྱུར། །
en: They will achieve tranquility, practice generosity on a vast scale, And become majestic princes born from lotus flowers.

source: དེ་ལ་སྟན་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering seats?

source: སྟན་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ས་གཞི་ལ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་རྡོ་རྗེའི་གདན་ཐོབ་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering seats represents the attainment of the vajra throne at the seat of awakening in all the worlds of the great trichiliocosms.

source: བདག་གིས་སྟན་གྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering seats!’

source: དེ་སྟན་གྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering seats,

source: དེ་བཞིན་གཤེགས་པ་དང་འཐུན་པའི་སྨོན་ལམ་བཞིན་དུ། སྟན་གྱི་སྦྱིན་པ་འདིས་ན་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ས་གཞི་ལ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་རྡོ་རྗེའི་གདན་ཐོབ་པར་བྱེད་པར་གྱུར་ཅིག་
en: ‘With aspirations that are in harmony with those of the thus-gone ones, through this offering of seats may I cause all beings to attain the vajra throne at the seat of awakening in all the worlds of the great trichiliocosms!’

source: སྟན་གྱི་སྦྱིན་པ་འདི་ཡིས་ན། །
en: “Through this offering of seats,

source: བྱང་ཆུབ་སྙིང་པོའི་རྡོ་རྗེའི་གདན། །བཟང་ཞིང་སྲ་ལ་བརྟན་པ་དག །ལུས་ཅན་རྣམས་ལ་འབྱུང་བར་ཤོག །
en: May the excellent, firm, and stable Vajra throne at the seat of awakening Appear to all beings!

source: སྣ་ཚོགས་རིན་ཆེན་བདུན་ལས་བྱས། །
en: “It is made of the seven precious substances;

source: འཕང་དུ་དཔག་ཚད་གཉིས་ཡོད་ལ། །ཁོ་ར་ཁོར་ཡུག་དཔག་ཚད་གཅིག །རི་རབ་བཞིན་དུ་སྤ་བ་དང་། །
en: Measuring two leagues in height And one in circumference, It is majestic like Mount Sumeru.

source: རིན་ཆེན་ལྗོན་ཤིང་བརྒྱས་བསྐོར་ཅིང་། །གཞལ་མེད་ཁང་གིས་ལེགས་པར་བརྒྱན། །
en: “It is surrounded by hundreds of precious trees, Adorned with celestial palaces,

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་བཀབ། །ནོར་བུ་རིན་ཆེན་སྤྲས་གསལ་བ། །
en: Covered with garlands of small bells, And ornamented with shining jewels.

source: ཚངས་པ་མཚུངས་པར་སྤྱོད་རྣམས་ལ། །ཁྲིའུ་དང་སྟན་དང་སྟེགས་བྱིན་པས། །འཁོར་བ་དག་ན་
en: “By offering chairs, seats, and stools To fellow practitioners of pure conduct,

source: འཁོར་བའི་ཚེ། །དེ་འདྲའི་སྟན་ནི་ཐོབ་པར་འགྱུར། །
en: One will attain such a seat While turning in cyclic existence.

source: དེ་ལ་ཡོ་བྱད་ཀྱི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering provisions?

source: ཡོ་བྱད་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཡོ་བྱད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering provisions represents the complete acquisition of the provisions for awakening.
